app/controllers/commands_controller.rb

SELECT * FROM "commands"
---
  def index
    @commands = Command.all

SELECT * FROM "commands" WHERE ("commands"."id" = 1)
---
  def show
    @command = Command.find(params[:id])

SELECT * FROM "commands" WHERE ("commands"."id" = 1)
---
  def edit
    @command = Command.find(params[:id])

INSERT INTO "commands" ("name", "created_at", "updated_at", "technique") VALUES('nextSlide', '2011-02-14 07:40:08', '2011-02-14 07:40:08', 'microscopy')
---
  def create
    @command = Command.new(params[:command])

    respond_to do |format|
      if @command.save

SELECT * FROM "commands" WHERE ("commands"."id" = 1)
UPDATE "commands" SET "updated_at" = '2011-03-20 18:58:38', "movement" = '01,200//02,-200//01,50' WHERE "id" = 1
---
  def update
    @command = Command.find(params[:id])

    respond_to do |format|
      if @command.update_attributes(params[:command])